#define _CRT_SECURE_NO_WARNINGS
#define bmpFile "C:\\Users\\Username\\Desktop\\resource\\BMP.bmp"
// *** bmpfile 은 배경이 될 사진의 경로입니다. 반드시 사용자에 맞는 경로로 수정해 주십시오. ***

#include <stdio.h>
#include <windows.h>
#include <math.h>

static BITMAP Bitmap;
static BITMAPINFOHEADER bInfo;
static unsigned char* pBits;

void editPixel(int x, int y, int c) {
    int width = ceil((double)Bitmap.bmWidth / (double)100);
    int height = ceil((double)Bitmap.bmHeight / (double)100);
    int flag = abs(Bitmap.bmWidthBytes / (Bitmap.bmBitsPixel / 8) - Bitmap.bmWidth) * 3;

    for (int j = y * height; j < (y + 1) * height; j++) {
        for (int i = x * width; i < (x + 1) * width; i++) {
            pBits[0 + (j * 3 * Bitmap.bmWidth) + (i * 3) + (Bitmap.bmWidthBytes % 3 + flag) * j] = c;
            pBits[1 + (j * 3 * Bitmap.bmWidth) + (i * 3) + (Bitmap.bmWidthBytes % 3 + flag) * j] = c;
            pBits[2 + (j * 3 * Bitmap.bmWidth) + (i * 3) + (Bitmap.bmWidthBytes % 3 + flag) * j] = c;
        }
    }
}

void myName(void) {
    const int NAME[][3] = { {0,0,255}, {1,0,255}, {2,0,255}, {3,0,255}, {4,0,255}, {5,0,255}, {6,0,255}, {7,0,255}, {8,0,255},
                    {0,1,255}, {1,1,0}, {2,1,0}, {3,1,0}, {4,1,0}, {5,1,0}, {6,1,0}, {7,1,0}, {8,1,255},
                    {0,2,255}, {1,2,255}, {2,2,255}, {3,2,255}, {4,2,0}, {5,2,255}, {6,2,255}, {7,2,255}, {8,2,255},
                    {3,3,255}, {4,3,0}, {5,3,255},
                    {3,4,255}, {4,4,255}, {5,4,255}, {6,4,255}, {7,4,255}, {8,4,255},
                    {6,5,255}, {7,5,0}, {8,5,255},
                    {6,6,255}, {7,6,0}, {8,6,255},
                    {0,7,255}, {1,7,255}, {2,7,255}, {3,7,255}, {4,7,255}, {5,7,255}, {6,7,255}, {7,7,0}, {8,7,255},
                    {0,8,255}, {1,8,0}, {2,8,0}, {3,8,0}, {4,8,0}, {5,8,0}, {6,8,0}, {7,8,0}, {8,8,255},
                    {0,9,255}, {1,9,255}, {2,9,255}, {3,9,255}, {4,9,255}, {5,9,255}, {6,9,255}, {7,9,255}, {8,9,255},

                    {12,0,255}, {13,0,255}, {14,0,255},
                    {12,1,255}, {13,1,0}, {14,1,255},
                    {9,2,255}, {10,2,255}, {11,2,255}, {12,2,255}, {13,2,0}, {14,2,255}, {15,2,255}, {16,2,255}, {17,2,255},
                    {9,3,255}, {10,3,0}, {11,3,0}, {12,3,0}, {13,3,0}, {14,3,0}, {15,3,0}, {16,3,0}, {17,3,255},
                    {9,4,255}, {10,4,255}, {11,4,255}, {12,4,255}, {13,4,255}, {14,4,255}, {15,4,255}, {16,4,255}, {17,4,255},
                    {10,5,255}, {11,5,255}, {12,5,0}, {13,5,0}, {14,5,0}, {15,5,255}, {16,5,255},
                    {10,6,255}, {11,6,0}, {12,6,255}, {13,6,255}, {14,6,255}, {15,6,0}, {16,6,255},
                    {10,7,255}, {11,7,0}, {12,7,255}, {13,7,255}, {14,7,255}, {15,7,0}, {16,7,255},
                    {10,8,255}, {11,8,255}, {12,8,0}, {13,8,0}, {14,8,0}, {15,8,255}, {16,8,255},
                    {11,9,255}, {12,9,255}, {13,9,255}, {14,9,255}, {15,9,255},

                    {24,0,255}, {25,0,255}, {26,0,255},
                    {24,1,255}, {25,1,0}, {26,1,255},
                    {18,2,255}, {19,2,255}, {20,2,255}, {21,2,255}, {22,2,255}, {23,2,255}, {24,2,255}, {25,2,0}, {26,2,255},
                    {18,3,255}, {19,3,0}, {20,3,0}, {21,3,0}, {22,3,0}, {23,3,0}, {24,3,0}, {25,3,0}, {26,3,255},
                    {18,4,255}, {19,4,255}, {20,4,255}, {21,4,255}, {22,4,255}, {23,4,255}, {24,4,255}, {25,4,255}, {26,4,255},
                    {18,5,255}, {19,5,0}, {20,5,255}, {21,5,255}, {22,5,255}, {23,5,0}, {24,5,255}, {25,5,0}, {26,5,255},
                    {18,6,255}, {19,6,255}, {20,6,0}, {21,6,255}, {22,6,0}, {23,6,255}, {24,6,255}, {25,6,0}, {26,6,255},
                    {19,7,255}, {20,7,0}, {21,7,255}, {22,7,0}, {23,7,0}, {24,7,0}, {25,7,0}, {26,7,255},
                    {19,8,255}, {20,8,255}, {21,8,0}, {22,8,255}, {23,8,255}, {24,8,255}, {25,8,0}, {26,8,255},
                    {20,9,255}, {21,9,255}, {22,9,255},
                    {24,9,255}, {25,9,255}, {26,9,255} };

    for (int i = 0; i < sizeof(NAME) / (sizeof(int) * 3); i++) editPixel(NAME[i][0], NAME[i][1], NAME[i][2]);
}

int main(void) {
    HWND hWnd = GetConsoleWindow();
    HDC hDC = GetDC(hWnd);
    HDC hMemDC = CreateCompatibleDC(hDC);
    SetStretchBltMode(hDC, COLORONCOLOR);

    HBITMAP hBitmap = (HBITMAP)LoadImage(NULL, TEXT(bmpFile), IMAGE_BITMAP, 0, 0, LR_LOADFROMFILE | LR_CREATEDIBSECTION);
    HBITMAP hOldBitmap = (HBITMAP)SelectObject(hMemDC, hBitmap);
    GetObject(hBitmap, sizeof(BITMAP), &Bitmap);
    pBits = (unsigned char*)Bitmap.bmBits;

    myName();

    StretchBlt(hDC, 50, 50, 800, 400, hMemDC, 0, 0, Bitmap.bmWidth, Bitmap.bmHeight, SRCCOPY);

    SelectObject(hMemDC, hOldBitmap);
    DeleteObject(hBitmap);
    DeleteDC(hMemDC);
    ReleaseDC(hWnd, hDC);

    return 0;
}