// <목표>

// 최소 : 배열과 포인터에 대해 확실하게
// 기본 : C언어 프로그램 두렵지 않게
// 목표 : 임베디드 SW를 염두에 둔 C 코딩

// 프로그래밍 능력의 향상
// -> 기초를 더욱 탄탄하게. 기초 중요

// 1학기 C언어 (1) 와 무엇이 다른가? 
// -> 컴퓨터시스템 / 로레벨 / 데이터

// CPU - Memory - BUS / Data Code 로 이루어지는 기본을 이해해야 한다.

// Visual Studio 2019+ 버전 설치
// 우분투 +GCC까지 동작하면 더욱 좋음

// OJ는 리눅스(우분투) 환경에서 동작하므로, 윈도우와 차이가 있을 수 있음에 주의

// 성적 : 시험 (중간, 기말, 퀴즈, 매주 테스트)
// 수업태도 및 출석
//  - 수업 집중 못하면 지적
//  - 지적 여러 번 당하면 감점 & 퇴출
// 과제 : 과제보다는 실습에 집중 (물론 과제도 있음)

// => 실력 함양에 목표

// 수업은 어렵게, 실습은 많게, 성적은 기분좋게...?

// 이번주 일요일까지 (09/04 밤 11시) 자기소개 파일 제출 (이러닝 사이트)
//  - HWP, MS Word 로 4장 이상
//  - 얼굴 또렷한 최신 셀카 사진 3개 이상과 글. 진정한 자기소개
//  - 자신의 인생관, 현재, 목표, 꿈, 어려움 등 자신을 표현

// 종이 시험이 있네...?

